# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
    #Пример:
        # 6 -> да
        # 7 -> да
        # 1 -> нет

d = int(input("Введите цифру, обозначающую день недели: "))

if d >= 6:
    print("Выходной!")
else:
    print("Рабочий день")

# 2. Напишите программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

for X in 0, 1:
    for Y in 0, 1:
        for Z in 0, 1:
            if not(X or Y or Z) == (not X and not Y and not Z):
                print(X, Y, Z)

# 3. Напишите программу, которая принимает на вход координаты точки (X и Y),
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
    # Пример:
        # x=34; y=-30 -> 4
        # x=2; y=4-> 1
        # x=-34; y=-30 -> 3

t_1 = int(input("Введите координату точки Х: "))
t_2 = int(input("Введите координату точки Y: "))

if t_1 > 0 and t_2 > 0:
    print("точка находится в 1-й четверти")
elif t_1 < 0 and t_2 > 0:
    print("точка находится во 2-й четверти")
elif t_1 < 0 and t_2 < 0:
    print("точка находится в 3-й четверти")
elif t_1 > 0 and t_2 < 0:
    print("точка находится в 4-й четверти")
else:
    print("Координаты точки не должны быть равны 0 !")

# 4. Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y)

ch = int(input("Введите цифру от 1 до 4, обозначающую номер четверти: "))

if ch == 1:
    print("Координаты точки будут (+)Х и (+)Y")
elif ch == 2:
    print("Координаты точки будут (-)Х и (+)Y")
elif ch == 3:
    print("Координаты точки будут (-)Х и (-)Y")
elif ch == 4:
    print("Координаты точки будут (+)Х и (+)Y")
else:
    print("Введите положительное число от 1 до 4.")

# 5. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
    # Пример:
        # A (3,6); B (2,1) -> 5,09
        # A (7,-5); B (1,-1) -> 7,21

import math
x_A = int(input("Введите координату точки xA: "))
y_A = int(input("Введите координату точки yA: "))
x_B = int(input("Введите координату точки xB: "))
y_B = int(input("Введите координату точки yB: "))

D = math.sqrt((x_A - x_B)**2 + (y_A - y_B)**2)
print(D)