# 1. Вычислить число Pi c заданной точностью *d* (d = 0.001)
'''
Метод с использованием формулы Лейбница.
Формула: х = 4 - 4/3 + 4/5 - 4/7 + 4/9 - ...
Этот ряд бесконечен, чем больше терминов содержит этот ряд, 
тем ближе значение X сходится к значению Пи.

''' 
from math import fabs  # для вычисления абсолютного значения числа
from math import pi

d = float(input('Введите значение точности: '))
sum = 0
a = 0
n = 0

while True:
    a = float((-1) ** n) / float(2 * n + 1)
    sum += a
    n += 1
    result = sum * 4

    if fabs(a) < d:
        break

print('Результат вычисления pi: ', result)
print('pi для сравнения: ', pi)
