# 1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
    # Пример:
        # 6782 -> 23
        # 0.56 -> 11

numbers = input("Введите вещественное число: ")
sum_numbers = 0

for i in numbers:
    if i != ".":
        sum_numbers = sum_numbers + int(i)
print("Сумма цифр равна: ", sum_numbers)

# 2. Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N.
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

N = int(input("Введите число N: "))
f = 1

for i in range(N):
    i = i + 1
    f = i * f
    
    print(f, end = " ")
